CSI API ETABS v1
cPointElm.GetLoadForce Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadForce(
	string Name,
	ref int NumberItems,
	ref string[] PointName,
	ref string[] LoadPat,
	ref int[] LcStep,
	ref string[] CSys,
	ref double[] F1,
	ref double[] F2,
	ref double[] F3,
	ref double[] M1,
	ref double[] M2,
	ref double[] M3,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadForce (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef PointName As String(),
	ByRef LoadPat As String(),
	ByRef LcStep As Integer(),
	ByRef CSys As String(),
	ByRef F1 As Double(),
	ByRef F2 As Double(),
	ByRef F3 As Double(),
	ByRef M1 As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim NumberItems As Integer
Dim PointName As String()
Dim LoadPat As String()
Dim LcStep As Integer()
Dim CSys As String()
Dim F1 As Double()
Dim F2 As Double()
Dim F3 As Double()
Dim M1 As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadForce(Name,
	NumberItems, PointName, LoadPat,
	LcStep, CSys, F1, F2, F3, M1, M2, M3,
	ItemTypeElm)
int GetLoadForce(
	String^ Name,
	int% NumberItems,
	array<String^>^% PointName,
	array<String^>^% LoadPat,
	array<int>^% LcStep,
	array<String^>^% CSys,
	array<double>^% F1,
	array<double>^% F2,
	array<double>^% F3,
	array<double>^% M1,
	array<double>^% M2,
	array<double>^% M3,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadForce :
        Name : string *
        NumberItems : int byref *
        PointName : string[] byref *
        LoadPat : string[] byref *
        LcStep : int[] byref *
        CSys : string[] byref *
        F1 : float[] byref *
        F2 : float[] byref *
        F3 : float[] byref *
        M1 : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
PointName
Type: System.String[]
LoadPat
Type: System.String[]
LcStep
Type: System.Int32[]
CSys
Type: System.String[]
F1
Type: System.Double[]
F2
Type: System.Double[]
F3
Type: System.Double[]
M1
Type: System.Double[]
M2
Type: System.Double[]
M3
Type: System.Double[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace